In [1]:
import pandas as pd

In [2]:
file_path = "shopping_data.csv"
df_shopping = pd.read_csv(file_path, encoding="ISO-8859-1")
df_shopping.sample(5)

     CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
82           83         Yes  57.0          54000                    51.0
92           93          No  68.0          59000                    55.0
100         101         Yes  48.0          61000                    42.0
140         141         Yes  19.0          74000                    10.0
86           87          No  21.0          54000                    57.0

In [3]:
df_shopping.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [4]:
df_shopping.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [7]:
for col in df_shopping.columns:
    print(f"column {col} has {df_shopping[col].isnull().sum()}")

column CustomerID has 0
column Card Member has 2
column Age has 2
column Annual Income has 0
column Spending Score (1-100) has 1

In [8]:
df_shopping = df_shopping.dropna()

In [9]:
df_shopping.duplicated().sum()

0

In [10]:
df_shopping.drop(columns=['CustomerID'],inplace=True)

In [11]:
df_shopping.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

In [13]:
def change_string(member):
    if member == "Yes":
        return 1
    else:
        return 0
    
df_shopping["Card Member"] = df_shopping["Card Member"].apply(change_string)
df_shopping.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0          15000                    39.0
1            1  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

In [14]:
df_shopping["Annual Income"] = df_shopping["Annual Income"] / 1000

In [15]:
df_shopping.columns = ["card_member", "age", "annual_income", "spend_score"]
df_shopping.sample(5)

     card_member   age  annual_income  spend_score
57             1  47.0           43.0         41.0
23             0  46.0           25.0          5.0
179            1  58.0           88.0         15.0
40             0  36.0           37.0         26.0
195            1  33.0          113.0          8.0

In [16]:
file_path = "shopping_data_cleaned.csv"
df_shopping.to_csv(file_path, index=False)